; 控制指令冲突测试
; 从这一节起，假设正确处理了延迟槽，行为与模拟器一样，延迟槽里可能填充语句。
; 结果：
; 4.006s @ 25.0000MHz, CPI=1.00
; 2.781s @ 36.0000MHz, CPI=1.00
; 2.517s @ 40.0000MHz, CPI=1.01
; 2.407s @ 42.0000MHz, CPI=1.01

; *** 程序说明：R4、R5为循环变量   ***
; ***     主要循环体0x06~0x09，4条 ***
; ***     每条各执行25,000,000次   ***
; ***     共1.00亿条指令           ***

; --------------------------------------------
; |冲突：(7)ADDIU后接(8)BNEZ
; |　　　(7)ADDIU后仅隔一句接延迟槽内的(9)CMP
; |　　　延迟槽内的(9)CMP接(6)BTEQZ
; |　　　延迟槽内的(9)CMP仅隔一句接(7)ADDIU
; --------------------------------------------

LI R1 1
LI R5 FF
SLL R5 R5 0
ADDIU R5 83
LI R4 60
CMP R4 R1
BTEQZ 3
ADDIU R4 1
BNEZ R4 FD
CMP R4 R1
BNEZ R5 F9
ADDIU R5 1
JR R7
NOP
