; 读写指令存储器测试

; 结果：
; 4.006s @ 25.0000MHz, CPI=1.34
; failed @ 100.000MHz, CPI=----

; *** 程序说明：R4、R5为循环变量   ***
; ***     主要循环体0x07~0x09，3条 ***
; ***     每条各执行25,000,000次   ***
; ***     共0.75亿条指令           ***

; --------------------------------------------
; |冲突：(7)SW写指令存储器
; |　　　延迟槽内(9)ADDIU后(7)SW
; |　　　延迟槽内(9)ADDIU后(8)BNEZ
; --------------------------------------------

LI R2 FF
LI R3 55
SLL R3 R3 0
LI R5 FF
SLL R5 R5 0
ADDIU R5 83
LI R4 61
SW R3 R4 1
BNEZ R4 FE
ADDIU R4 1
BNEZ R5 FB
ADDIU R5 1
JR R7
NOP
